# Operation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentChangedEventArgs..::..Operation Property
DocumentChangedEventArgs Class See Also
---
The operation associated with this event
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public UndoOperation Operation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Operation As UndoOperation
	Get
```

Visual C++
---
```text
public:
property UndoOperation Operation {
	UndoOperation get ();
}
```

# See Also
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace